app/controllers/songs_controller.rb

  def update
    @song.update(song_params)
---
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 1], ["updated_at", "2017-11-25 18:43:38.801660"], ["id", 6]]